vegeta/testcandidates/prisma/results/2018-07-08_19:47/byArtistId-2750.txt
Requests      [total, rate]            165000, 2565.93
Duration      [total, attack, wait]    1m15.897150342s, 1m4.304159934s, 11.592990408s
Latencies     [mean, 50, 95, 99, max]  8.251898894s, 8.163527922s, 14.801456611s, 20.340353068s, 30.472795138s
Bytes In      [total, mean]            3185500, 19.31
Bytes Out     [total, mean]            4501250, 27.28
Success       [ratio]                  20.98%
Status Codes  [code:count]             200:34625  0:130375  
Error Set:
Post http://localhost:4466: net/http: timeout awaiting response headers
Post http://localhost:4466: dial tcp 0.0.0.0:0->127.0.0.1:4466: bind: address already in use
Post http://localhost:4466: EOF
Post http://localhost:4466: read tcp 127.0.0.1:48461->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42009->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:45237->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42203->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42110->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42141->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42325->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:43781->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:46455->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:43145->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:43143->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42089->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:43085->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:43091->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:43127->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:43111->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:43179->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:43047->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:50093->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:49785->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42559->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:48975->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:48690->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:47597->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42505->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: http: server closed idle connection
Post http://localhost:4466: read tcp 127.0.0.1:50393->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:44469->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:49723->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:34532->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:48735->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:47313->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:47941->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:44412->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:49601->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:50773->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:46277->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:49619->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:48467->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:47261->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:44143->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:44479->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42739->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42599->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:45795->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42439->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:47117->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:50743->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:49457->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:44527->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:43663->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42609->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:45831->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:49063->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54065->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:48483->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:46951->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:48727->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:49925->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42911->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:47889->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:46123->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:46159->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:43655->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:46421->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:49955->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42729->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42945->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:46423->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:46471->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:46619->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42849->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:45311->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42969->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42709->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:49389->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:45339->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:48275->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:46219->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:47299->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:38158->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:44423->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:47277->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:49654->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:46657->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:43711->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:47225->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:45909->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:46003->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:44912->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:45947->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:48684->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:49321->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:49491->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:50473->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:49273->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54703->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:46203->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:47233->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:50739->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42967->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42535->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:53248->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:49041->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:47895->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:44445->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:43447->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:48965->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:45739->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:50432->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:48761->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:58968->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:47317->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:48739->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:44489->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:47521->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:47797->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:53401->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:49905->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:44649->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: dial tcp 0.0.0.0:0->127.0.0.1:4466: i/o timeout
Post http://localhost:4466: dial tcp 0.0.0.0:0->127.0.0.1:4466: context deadline exceeded
Post http://localhost:4466: dial tcp: i/o timeout
Post http://localhost:4466: read tcp 127.0.0.1:37824->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:58878->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:40685->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:40060->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:36181->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:35509->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:44648->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:36628->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54232->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:37366->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:58081->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:37174->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:39547->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:38855->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:40048->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:34118->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:46507->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:53101->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:51911->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:43499->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:51074->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:44951->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:39950->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:39944->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:55717->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:43431->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:49477->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42727->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:34965->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:53590->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:52479->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:35146->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:59762->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:38308->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:47201->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:44624->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:47801->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:34846->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:36670->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:49314->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:46296->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:39982->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:45475->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:49506->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:47988->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:34981->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:48750->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:48678->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:49526->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:49432->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54521->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:56050->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:56999->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:37860->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:57225->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54637->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:34443->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:34737->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:55385->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:57191->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:44288->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:38624->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:37591->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:48287->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:48983->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:43553->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:45023->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:48285->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:35492->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:40471->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:45201->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:59340->127.0.0.1:4466: read: connection reset by peer